export const UK_TRANSLATIONS = {
  'UI': {
    'WELCOME': "😊 Вітаємо в інтелектуальному чаті передачі показників",
    'WELCOME_NOT_AUTHED_MESSAGE': 'Аби побачити свої чатики, треба увійти.',
    'WELCOME_EXAMPLES': {
      'SEND': '🔼 З легкістю передавай показники!',
      'READ': '📊 Та потужно отримуй їх!'
    },
    'HOME': "Головна",
    'START_NEW_CHAT': "Створити новий чат",
    'CHATS': "Чати",
    'INITIAL_CHAT_MESSAGE': '🤚 Салют, друже! 📊 Тут ти можеш з легкістю передати або отримати показники. 🌌 Просто напиши що ти хочеш зробити, і далі ми зробимо трішки магії.',
    'TITLE': "Назва",
    'FIELD_REQUIRED': "Це поле обов'язкове",
    'NO_CHATS': "Ой, а в тебе немає чатів 😔. Давай мершій створювати 🤖",
    'CHATS_ACTIONS': {
      'CREATED': 'Ухти, вітаємо зі створенням чату 😜. Нехай ваші показники не затримуються 🦅',
      'DELETED': 'Бац і немає чатику 😼'
    },
    'AUTH': {
      'LOGIN': "Увійти 👋",
      'EMAIL': "Пошта",
      'PASSWORD': "Пароль",
      'REGISTER': "Зареєструватись ✋",
      'LOGOUT': "Вийти 👀",
      "INVALID_CREDENTIALS": "🧐 Неправильний логін чи пароль",
      "NOT_FOUND": "😮 Такого козака не існує",
      "CONFLICT": "🦅 В нас вже є такий потужний з такою поштою",
      "PASSWORD_TROUBLE": "💪 Треба потужніший пароль"
    },
    'SUBMIT': "Підтвердити",
    'SEND': "Відправити",
    'INPUT_PLACEHOLDER': "Тут треба щось натицяти ✍️",
    'LANGUAGES': {
      'UK': "Українська",
      'EN': "Англійська",
      'DE': "Німецька"
    },
    'RESULT_ERRORS': {
      'UNKNOWN_COMMAND': '🤷‍♂️ Упс, ми не можемо розібратись з твоїм запитом. 🐵 Зберись та спробуй знову.',
      'TYPE_UNSUPPORTED': '😔 Наразі ми не підтримуємо передачу показників за таким лічильником. Але в майбутньому все можливо.',
      'MISSING_PARAMS': '🤓 Ми розпізнали твоє бажання, але нам не вистачає трішечки даних для виконання. 🫦 Спробуй будь ласка ще раз.',
      'UNEXPECTED_ERROR': '😰 Ой лишенько, щось непідвладне нам трапилось. Спробуй тріііішечки пізніше'
    },
    'METERS_MESSAGES': {
      'NO_METERS': '🚫 Зараз в тебе немає показників. Але можеш виправити, дай нам лише знати.',
      'METERS_LIST': '💪 Ось твої потужні показники:',
      'METER_SENT': '✅ От і все! Як просто передати показники.'
    }
  }
}
